scripts/load-test.yml
config:
  target: '{{ $processEnvironment.TARGET_URL }}'
  phases:
    - duration: 20
      arrivalRate: 50
      name: 'High concurrency burst'

scenarios:
  - name: 'Concurrent booking requests'
    flow:
      - post:
          url: '/api/book'
          json:
            eventId: 'concert-2026'